Repository: leeohalloran/ediabaslib
Catalog: Tools/Psdz/PsdzClientLibrary/Resources/Strings.*.resx
Languages: de

# AppRestartRequired
source: Application restart required.
de: Die Applikation muss neu gestartet werden.

source: Backup data restored.
de: Backupdaten wiederhergestellt.

# BatteryVoltage
source: Battery voltage: {0:0.00}V
de: Batteriespannung: {0:0.00}V

# BatteryVoltageError
source: Error: The battery voltage {0:0.00}V is out of valid range: {1:0.00}V - {2:0.00}V. Please connect a certified charger for the whole coding session. Do you want to retry the operation?
de: Fehler: Die Batteriespannung {0:0.00}V ist außerhalb des gültigen Bereichs: {1:0.00}V - {2:0.00}V. Bitte schließen Sie ein zertifiziertes Ladegerät während des gesamten Kodiervorgangs an. Wollen Sie den Vorgang wiederholen?

# BatteryVoltageInfo
source: Information: The battery voltage {0:0.00}V is inside the valid range: {1:0.00}V - {2:0.00}V. Please connect a certified charger for the whole coding session.
de: Information: Die Batteriespannung {0:0.00}V ist innerhalb des gültigen Bereichs: {1:0.00}V - {2:0.00}V. Bitte schließen Sie ein zertifiziertes Ladegerät während des gesamten Kodiervorgangs an.

# BatteryVoltageWarn
source: Warning: The battery voltage {0:0.00}V is out of valid range: {1:0.00}V - {2:0.00}V. Please connect a certified charger for the whole coding session.
de: Warnung: Die Batteriespannung {0:0.00}V ist außerhalb des gültigen Bereichs: {1:0.00}V - {2:0.00}V. Bitte schließen Sie ein zertifiziertes Ladegerät während des gesamten Kodiervorgangs an.

# ContextMissing
source: Context not found.
de: Kontext nicht gefunden.

# CreateBackupPathFailed
source: Creating backup path failed.
de: Erzeugen des Backupverzeichnisses fehlgeschlagen.

# DbInfo
source: Database version: {0}, date: {1}
de: Datenbank Version: {0}, Datum: {1}

source: Detecting installed ECUs ...
de: Installierte Steuergeräte erkennen ...

# DetectInstalledEcusFailed
source: Detecting installed ECUs failed.
de: Erkennen der installierten ECUs fehlgeschlagen.

# ExceptionMsg
source: Error: {0}
de: Fehler: {0}

source: Executing backup TAL ...
de: Backup TAL wird ausgeführt ...

source: Executing restore TAL ...
de: Restore TAL wird ausgeführt ...

source: Executing TAL ...
de: TAL wird ausgeführt ...

# ExecutingVehicleFunc
source: Executing operation ...
de: Vorgang wird ausgeführt ...

# ExecutingVehicleFuncFinished
source: Operation finished.
de: Vorgang abgeschlossen.

source: FA backup write failed.
de: Backup FA schreiben fehlgeschlagen.

source: FA backup written.
de: Backup FA geschrieben.

source: FA write failed.
de: FA schreiben fehlgeschlagen.

source: FA written.
de: FA geschrieben.

# GenerateInfoFilesFailed
source: Generating vehicle info files failed.
de: Generieren der Fahrzeug Infodateien fehlgeschlagen.

# GeneratingInfoFiles
source: Generating vehicle info files.
de: Fahrzeug Infodateien werden generiert.

# HostStarted
source: Service host started.
de: Service Host gestartet.

# HostStartFailed
source: Starting host failed.
de: Host starten fehlgeschlagen.

# HostStarting
source: Starting service host ...
de: Service Host starten ...

# HostStopped
source: Service host stopped.
de: Service Host gestoppt.

# HostStopping
source: Stopping service host ...
de: Service Host stoppen ...

# HwReplaceContinue
source: A hardware replacement operation is active. Do you want to continue the last hardware replace operation?
de: Ein Hardwaretausch Vorgang ist aktiv. Wollen Sie den letzten Hardwaretausch fortsetzen?

source: ILevel backup failed.
de: IStufe Backup fehlgeschlagen.

source: ILevel backup updated.
de: IStufe Backup aktualisiert.

source: ILevel updated.
de: IStufe aktualisiert.

source: ILevel update failed.
de: IStufen aktualisieren fehlgeschlagen.

# NcdFailures
source: Detected Ncd failures.
de: NCD Fehler erkannt.

# NcdOnlineCalculation
source: NCD online calculation required. Probably you have selected a chargable option.
de: NCD Online Berechnung notwendig. Vermutlich haben Sie eine kostenpflichtig Option ausgewählt.

# NoNcdRequestFile
source: NCD request file missing.
de: NCD Anfrage-Datei fehlt.

# NoTargetILevel
source: No target ILevel present.
de: Keine Ziel IStufe vorhanden.

# NoVehiceLicense
source: Not valid license for vehicle present.
de: Keine gültige Lizenz für dieses Fahrzeg vorhanden.

source: PIA master updated.
de: PIA Master aktualisiert.

source: PIA master update failed.
de: PIA Master aktualisieren fehlgeschlagen.

# PrgCounterCheckFailed
source: Check programming counter failed.
de: Lesen der Programmierzähler fehlgeschlagen.

# PrgCounters
source: Programming counters: {0}
de: Programmierzähler: {0}

# ReadFaFailed
source: Reading FA failed.
de: FA lesen fehlgeschlagen.

# ReadILevelFailed
source: Reading ILevel failed.
de: IStufe lesen fehlgeschlagen.

# ReadVinFailed
source: Reading VIN failed.
de: FG-NR lesen fehlgeschlagen.

# RequestEcuContextFailed
source: Requesting ECU context failed.
de: Steuergeräte Kontext anfragen fehlgeschlagen.

# RequestedPlannedConstructionFailed
source: Requesting planned construction failed.
de: Geplante Konstruktion abfragen fehlgeschlagen.

source: Requesting ECU context ...
de: Steuergeräte Kontext anfragen ...

# SoftwareFailures
source: Detected {0} software failures.
de: {0} Softwarefehler erkannt.

# SwtAction
source: Requesting SWT action ...
de: SWT Aktionen abrufen ...

# SwtActionCount
source: SWT actions: {0}
de: SWT Aktionen: {0}

# SwtActionFailed
source: Request SWT action failed.
de: SWT Aktionen abrufen fehlgeschlagen.

# TalBackupFaChanged
source: The FA has changed since the last backup. Do you want to restore the settings of the last backup?
de: Die FA hat sich seit dem letzten Backup geändert. Wollen Sie die Einstellungen vom letzten Backups wiederherstellen?

# TalBackupGenerating
source: Generating backup TAL ...
de: Generiere Backup TAL ...

# TalBackupGenerationFailed
source: Backup TAL generation failed.
de: Backup TAL Generierung fehlgeschlagen.

# TalDisableFlash
source: Do you want to disable all flash operations for this session?
de: Wollen Sie alle Flashoperationen in dieser Sitzung deaktivieren?

# TalExecuteAgain
source: Do you want to execute the main TAL again (slow)?
de: Wollen Sie die Haupt-TAL nochmals ausführen (langsam)?

# TalExecuteError
source: TAL execution finished with errors.
de: TAL Ausführung mit Fehlern beendet.

# TalExecuteErrorContinue
source: Problems have occured in the preparation phase. No liability in case of failure or problems after coding! Do you still want to continue with TAL execution?
de: Es sind Probleme in der Vorbereitsungsphase auftegetreten. Keine Haftung bei Schäden oder Problemen nach der Kodierung! Wollen Sie trotzdem die TAL ausführen?

# TalExecuteLastSkipped
source: The last time the TAL execution has been skipped.
de: Das letzte Mal wurde die TAL Ausführung übersprungen.

# TalExecuteLastSuccess
source: The last time the TAL has been executed successfully.
de: Das letzte Mal wurde die TAL erfolgreich ausgeführt

# TalExecuteOk
source: TAL execution finished ok.
de: TAL Ausführung ohne Fehler beendet.

# TalExecuteOkContinue
source: Preparation has been finshied successfully. No liability in case of failure or problems after coding! Do you want to continue with TAL execution?
de: Die Vorbereitung wurde erfolgreich abgeschlossen. Keine Haftung bei Schäden oder Problemen nach der Kodierung! Wollen Sie die TAL ausführen?

# TalExecuteWarning
source: TAL execution finished with warnings.
de: TAL Ausführung mit Warnungen beendet.

# TalExecutionFailMessage
source: TAL execution failed. Do you want to retry TAL execution with the same settings later?
de: Die Ausführung der TAL ist fehlgeschlagen. Wollen Sie die TAL Ausführung später mit den gleiche Einstellungen nochmals wiederholen?

# TalExecutionHint
source: Make sure that the ignition is switched on, the motor is stopped and a certified charger is connected to the vehicle. Don't close or minimize this page, because this will interrupt vehicle communcation! Do you want to continue?
de: Stellen Sie sicher, dass die Zündung eingeschaltet, der Motor gestoppt und ein zerifiziertes Ladegerät mit dem Fahrzeug verbunden ist. Schließen oder minimieren Sie diese Seite nicht, weil dies die Verbindung zum Fahrzeug unterbricht! Wollen Sie Fortfahren?

# TalExecutionOkMessage
source: The TAL execution has been finished successfully. Do you want to keep the backup data?
de: Die TAL wurde erfolgreich ausgeführt. Wollen Sie die Backupdaten behalten?

# TalFlashOperation
source: The TAL contains flash operations but flashing is disabled for safety reasons. Possibly the software is not consistent in all ECUs.
de: Die TAL enthält Flashoperationen, aber flashen ist aus Sicherheitsgründen deaktiviert. Möglicherweise ist die Sofware in den Steuergeräten nicht konsitent.

# TalGenerating
source: Generating TAL ...
de: Generiere TAL ...

source: TAL generation failed.
de: TAL Generierung fehlgeschlagen.

# TalHwDeinstallFinished
source: After replacement select the replaced ECUs at the category 'after the exchange'.
de: Wählen Sie nach dem Tausch die ersetzten Steuergeräte in der Kategorie 'nach dem Tausch'.

# TalIdrGenerating
source: Generating individual data TAL ...
de: Generiere Individualdaten TAL ...

# TalMissing
source: TAL not present.
de: TAL nicht vorhanden.

# TalOperationContinue
source: A backup of the last TAL is present. Do you want to execute the last TAL again? The last settings have to stay unmodified in this case.
de: Es ist ein Backup der letzten TAL vorhanden. Wollen Sie die letzte TAL nochmals ausführen? Die letzten Einstellungen dürfen in diesem Fall nicht verändert werden.

# TalRestoreGenerationFailed
source: Restore TAL generation failed.
de: Restore TAL Generierung fehlgeschlagen.

# TalRestoreGenrating
source: Generating restore TAL ...
de: Generiere Restore TAL ...

# TestModuleDataMissing
source: Test module data not present.
de: Testmoduldaten nicht vorhanden.

# TestModuleFailures
source: Test module generation failures: {0}
de: Fehler bei Testmodul Generierung: {0}

# TestModuleNotCompleted
source: Test module generation not completed: {0}%
de: Testmodul Generierung nicht abgeschlossen: {0}%

# TestModuleProgress
source: {0}%, Failures: {1}
de: {0}%, Fehler: {1}

source: TSL updated.
de: TSL aktualisiert.

source: TSL update failed.
de: TSL aktualisieren fehlgeschlagen.

# UpdateVehicleDataFailed
source: Updating vehicle data failed.
de: Fahrzeugdaten aktualisieren fehlgeschlagen.

source: Vehicle connected.
de: Fahrzeug verbunden.

# VehicleConnecting
source: Connecting vehicle ...
de: Fahrzeug verbinden ...

# VehicleDatabaseInvalid
source: Vehicle database invalid or too old.
de: Fahrzeugdatenbank ungültig oder zu alt.

# VehicleDetecting
source: Detecting vehicle ...
de: Fahrzeug erkennen ...

# VehicleDetectingProgress
source: Detecting vehicle: {0}%
de: Fahrzeug erkennen: {0}%

source: Vehicle detection failed.
de: Fahrzeug erkennen fehlgeschlagen.

source: Vehicle disconnected.
de: Fahrzeug getrennt.

# VehicleDisconnecting
source: Disconnecting vehicle ...
de: Fahrzeug trennen ...

# VehicleInfo
source: VIN={0}, Series={1} ILevel ship={2} current={3}
de: FG-NR={0}, Serie={1} IStufe produktion={2} aktuell={3}

# VehicleNoTargetSelector
source: Target selector not detected.
de: Target Selector nicht erkannt.

source: Vehicle not connected.
de: Fahrzeug nicht verbunden.

# VehicleSeriesInvalid
source: Detected vehicle series : {0}. Coding is available only for F series or higher.
de: Erkannte Fahrzeugserie: {0}. Kodieren ist nur verfügbar für F Modelle oder höher.

source: Vehicle series not detected.
de: Fahrzeugserie nicht erkannt.

# RequestedFlashSetupFailed
source: Requesting planned development failed.
de: Sollverbauung abrufen fehlgeschlagen.

# CertificatesNotPresent
source: Certifiates for secure connection missing.
de: Zertifikate für sichere Verbindung nicht vorhanden.
